Допишите программу самым эффективным способом так ,чтобы вывести квадраты чисел от 1 до 10#    print(i ** 2)
^^
for i in range(1, 10):!
    *!
/////
Допишите программу самым эффективным способом так ,чтобы вывести квадратные корни чисел о 1 до 10#    print(m ** 0.5)
^^
for m in range(1, 10):!
    *
/////
Выведите считанное слово 4 раза на 1 строке самым эффективным способом, не разделяя пробелами.#print(x * 4)@print(4 * x)
^^
x = input()!
*
---
Создайте массив m c квадратами чисел от 1 до 10 самым коротким способом, используя только переменную i#m = [i ** 2 for i in range(1, 11)]
^^
*!
/////
Что надо написать, чтобы в консоли напечаталось ‘Hello, world!’#print('Hello, world!')@print("Hello, world!")
^^
*
/////
Что надо написать, чтобы считать слово с консоли в переменную word?#word = input()
^^
*
---
Напишите слово так, чтобы программа выводила «ДА» если введенная строка равна “Python”#    print('ДА')@    print("ДА")
^^
word = input()!
if word == 'Python'!
    *
/////
Распечайтай 5 в квадрате самым эффективным способом#print(5 ** 2)
^^
*
/////
Что нужно сделать, чтобы считать цифру с консоли в переменную numb#numb = int(input())
^^
*
-----
Выведите на экран длину строки word#print(len(word))
^^
word = input()!
*
/////
Впишите такое слово чтобы программа считывала числа до тех пор пока число не равно нулю#    number = int(input())
^^
number = int(input())!
while not (number == 0):!
    *
/////
Cоздайте множество x#x = set()
^^
*
---
Допишите програму так,чтобы программа каждый раз добавляла в множество переменную town#    x.add(town)
^^
x = set()!
for i in range(n):!
    town = input()!
   *
/////
Допишите программу так чтобы name вышла на экран k раз#    print(name)
^^
name = input()!
k = int(input())!
for i in range(k):!
    *
/////
Выведите 4 букву строки word на экран самым эффективным способом.#print(word[3])
^^
word = 'Привет, друг'!
*
---
Напишите программу так, чтобы она создала пустой список в переменной list#list = list()@list = []
^^
*
/////
Распечатайте 3 элемент списка array#print(array[2])
^^
array = [1, 2, 3, 4]!
*
/////
Выведите длинну списка на экран#print(6)@print(len(x))
^^
x = [1, 2, 3, 4, 5, 6]!
*